### 1) Create a table with id : int, name: varchar(400), description: text, category_id: int, chef_id: int(255), created:datetime and execute the following statements:

In [2]:
import sqlite3
conn = sqlite3.connect('recipe.db')
print("Database created successfully")
conn.execute('''CREATE TABLE RECIPE1
             (ID INT, NAME VARCHAR(400), DESCRIPTION TEXT, 
             CATEGORY_ID  INT, CHEF_ID INT(255), CREATED DATETIME )''')
print("Table created successfully")
conn.close()

Database created successfully
Table created successfully

In [8]:
import sqlite3
conn = sqlite3.connect('recipe.db')
conn.execute('''INSERT INTO RECIPE1 VALUES(01, 'MANCHURIAN', 'CHINESE', 100, 00001, '2022-04-16 10:50:30')''')
conn.execute('''INSERT INTO RECIPE1 VALUES(02, 'PIZZA', 'ITALIAN', 101, 00002, '2022-04-16 12:50:32')''')
conn.execute('''INSERT INTO RECIPE1 VALUES(03, 'PANEER BUTTER MASALA','INDIAN', 102, 00003, '2022-04-17 10:34:34')''')
conn.execute('''INSERT INTO RECIPE1 VALUES(04, 'FRIED RICE','CHINESE', 103, 00004, '2022-04-05 09:56:10')''')
conn.commit()
conn.close()

In [9]:
import sqlite3
conn = sqlite3.connect('recipe.db')
cursor = conn.execute("SELECT * FROM RECIPE1")
for i in cursor:
    print(i)
conn.close()

(1, 'MANCHURIAN', 'CHINESE', 100, 1, '2022-04-16 10:50:30')
(2, 'PIZZA', 'ITALIAN', 101, 2, '2022-04-16 12:50:32')
(3, 'PANEER BUTTER MASALA', 'INDIAN', 102, 3, '2022-04-17 10:34:34')
(4, 'FRIED RICE', 'CHINESE', 103, 4, '2022-04-05 09:56:10')

### 1.1)Write a query to display the total number of recipes available with the description "Chinese"

In [10]:
import sqlite3
conn = sqlite3.connect('recipe.db')
cursor = conn.execute("SELECT * FROM RECIPE1 where DESCRIPTION = 'CHINESE'")
for i in cursor:
    print(i)
conn.close()

(1, 'MANCHURIAN', 'CHINESE', 100, 1, '2022-04-16 10:50:30')
(4, 'FRIED RICE', 'CHINESE', 103, 4, '2022-04-05 09:56:10')

### 1.2) Write a query to display the id, name of the recipes with chef_id '0002'

In [11]:
import sqlite3
conn = sqlite3.connect('recipe.db')
cursor = conn.execute("SELECT ID, NAME FROM RECIPE1 where CHEF_ID = 0002")
for i in cursor:
    print(i)
conn.close()

(2, 'PIZZA')

### 1.3)Write a query to display the description of the recipes whose name begins with 'P'

In [16]:
import sqlite3
conn = sqlite3.connect('recipe.db')
cursor = conn.execute("SELECT DESCRIPTION FROM RECIPE1 where NAME like 'P%'")
for i in cursor:
    print(i)
conn.close()

('ITALIAN',)
('INDIAN',)

### 2) Create a table movie of the below structure and assume data types: Movie_ID,Movie_name,genre,language,rating and execute the following statements:

In [17]:
import sqlite3
conn = sqlite3.connect('movie.db')
print("Database created successfully")
conn.execute('''CREATE TABLE MOVIE(MOVIE_ID INT, MOVIE_NAME CHAR(400), GENRE CHAR(100), LANGUAGE CHAR(100), RATING INT)''')
print("Table created successfully")
conn.close()

Database created successfully
Table created successfully

In [19]:
import sqlite3
conn = sqlite3.connect('movie.db')
conn.execute('''INSERT INTO MOVIE VALUES(100,'Pushpa- the rise', 'Thriller', 'Telugu', 7.6)''')
conn.execute('''INSERT INTO MOVIE VALUES(101, 'Hridayam', 'Romance', 'Malayalam', 8.1)''')
conn.execute('''INSERT INTO MOVIE VALUES(102, 'Love story', 'Romance', 'Telugu', 6.9)''')
conn.execute('''INSERT INTO MOVIE VALUES(103, '83', 'Drama', 'Hindi', 7.6)''')
conn.execute('''INSERT INTO MOVIE VALUES(104, 'Home', 'Drama', 'Malayalam', 8.9)''')
conn.commit()
print("Values inserted")
conn.close()

Values inserted

In [20]:
import sqlite3
conn = sqlite3.connect('movie.db')
cursor = conn.execute("SELECT * FROM MOVIE")
for i in cursor:
    print(i)
conn.close()

(100, 'Pushpa- the rise', 'Thriller', 'Telugu', 7.6)
(101, 'Hridayam', 'Romance', 'Malayalam', 8.1)
(102, 'Love story', 'Romance', 'Telugu', 6.9)
(103, '83', 'Drama', 'Hindi', 7.6)
(104, 'Home', 'Drama', 'Malayalam', 8.9)

### 2.1) Update the movie rating by 10% and display it

In [21]:
import sqlite3
conn = sqlite3.connect('movie.db')
conn.execute("UPDATE MOVIE SET RATING = RATING + (0.1*RATING)")
conn.commit()
cursor = conn.execute("SELECT RATING FROM MOVIE")
print("updated ratings:")
for i in cursor:
    print(i)

updated ratings:
(8.36,)
(8.91,)
(7.590000000000001,)
(8.36,)
(9.790000000000001,)

### 2.2) Delete the movies with movie_id 102

In [22]:
import sqlite3
conn = sqlite3.connect('movie.db')
conn.execute("DELETE FROM MOVIE WHERE MOVIE_ID = 102")
conn.commit()
cursor = conn.execute("SELECT * FROM MOVIE")
for i in cursor:
    print(i)

(100, 'Pushpa- the rise', 'Thriller', 'Telugu', 8.36)
(101, 'Hridayam', 'Romance', 'Malayalam', 8.91)
(103, '83', 'Drama', 'Hindi', 8.36)
(104, 'Home', 'Drama', 'Malayalam', 9.790000000000001)

### 2.3)Select movies whose rating is more than 3

In [24]:
import sqlite3
conn = sqlite3.connect('movie.db')
cursor = conn.execute("SELECT MOVIE_NAME FROM MOVIE where RATING > 3.0")
for i in cursor:
    print(i)
conn.close()

('Pushpa- the rise',)
('Hridayam',)
('83',)
('Home',)

###  3) Create a course database with the following fields Product(ID, Prod_name,Supplier_id,Unit_price,Package,OrderID),OrderItem(ID,Order_id,Product_id,Unit_price,Quantity) using Foreign key and execute the following statements:

In [27]:
import sqlite3
conn = sqlite3.connect('product.db')
print("Database created successfully")
conn.execute('''CREATE TABLE PRODUCT1(ID INT PRIMARY KEY NOT NULL, PROD_NAME CHAR(300), SUPPLIER_ID INT, UNIT_PRICE INT, PACKAGE INT, ORDERID INT)''')
conn.execute('''CREATE TABLE ORDERITEM1(ID INT, ORDER_ID INT, PRODUCT_ID INT , UNIT_PRICE INT, QUANTITY INT ,FOREIGN KEY(QUANTITY) REFERENCES PRODUCT(ID)
)''')
print("Tables created successfully")
conn.close()

Database created successfully
Tables created successfully

In [2]:
import sqlite3
conn=sqlite3.connect('product.db')
conn.execute("INSERT INTO PRODUCT1 VALUES(1, 'PENS', 90, 10, 09, 120)")
conn.execute("INSERT INTO PRODUCT1 VALUES(2, 'PENCILS', 91, 10, 10, 121)")
conn.execute("INSERT INTO PRODUCT1 VALUES(3, 'BOOKS', 92, 40, 11, 122)")
conn.execute("INSERT INTO PRODUCT1 VALUES(4, 'SCALES', 93, 10, 12, 123)")
conn.execute("INSERT INTO ORDERITEM1 VALUES(100, 090, 456, 10, 7)")
conn.execute("INSERT INTO ORDERITEM1 VALUES(101, 091, 457, 10, 7)")
conn.execute("INSERT INTO ORDERITEM1 VALUES(102, 092, 458, 40, 8)")
conn.execute("INSERT INTO ORDERITEM1 VALUES(103, 093, 459, 10, 3)")
conn.commit()
conn.close()

In [4]:
import sqlite3
conn = sqlite3.connect('product.db')
cursor = conn.execute("SELECT * FROM PRODUCT1")
for i in cursor:
    print(i)
cursor = conn.execute("SELECT *FROM ORDERITEM1")
for j in cursor:
    print(j)

(1, 'PENS', 90, 10, 9, 120)
(2, 'PENCILS', 91, 10, 10, 121)
(3, 'BOOKS', 92, 40, 11, 122)
(4, 'SCALES', 93, 10, 12, 123)
(100, 90, 456, 10, 7)
(101, 91, 457, 10, 7)
(102, 92, 458, 40, 8)
(103, 93, 459, 10, 3)

### 3.1) Display the total quantity of every product in the stock

In [5]:
import sqlite3
conn = sqlite3.connect('product.db')
cursor = conn.execute("SELECT QUANTITY FROM ORDERITEM1")
for i in cursor:
    print(i)
conn.close()

(7,)
(7,)
(8,)
(3,)

### 3.2)Sort the unit price based on the supplier_id

In [7]:
import sqlite3
conn = sqlite3.connect('product.db')
conn.execute("SELECT * FROM PRODUCT1 ORDER BY SUPPLIER_ID")
conn.commit()
cursor= conn.execute("SELECT UNIT_PRICE FROM PRODUCT1")
for i in cursor:
    print(i)
conn.close()

(10,)
(10,)
(40,)
(10,)

### 3.3) Display the product_name along with order_id and supplier_id

In [10]:
import sqlite3
conn = sqlite3.connect('product.db')
cursor = conn.execute("SELECT PROD_NAME, ORDERID, SUPPLIER_ID FROM PRODUCT1")
for i in cursor:
    print(i)
conn.close()

('PENS', 120, 90)
('PENCILS', 121, 91)
('BOOKS', 122, 92)
('SCALES', 123, 93)

### 4)Write a SQL lite3 statement to create a table named as job including columns job_id,job_title,Min-salary,Max_salary.job_id column does not contain any duplicate value at the time of insertion :

In [11]:
import sqlite3
conn = sqlite3.connect('job.db')
print("Database created successfully")
conn.execute('''CREATE TABLE JOB(JOB_ID INT PRIMARY KEY, JOB_TITLE CHAR(100) NOT NULL, MIN_SALARY INT NOT NULL, MAX_SALARY INT NOT NULL)''')
print("Table created successfully")
conn.close()

Database created successfully
Table created successfully

In [12]:
import sqlite3
conn = sqlite3.connect('job.db')
conn.execute('''INSERT INTO JOB VALUES(100, 'PRESIDENT', 50000, 100000)''')
conn.execute('''INSERT INTO JOB VALUES(101, 'VICE PRESIDENT', 50000, 100000)''')
conn.execute('''INSERT INTO JOB VALUES(102, 'DIRECTOR', 50000, 100000)''')
conn.execute('''INSERT INTO JOB VALUES(103, 'MANAGER', 50000, 100000)''')
conn.commit()
conn.close()

In [13]:
import sqlite3
conn = sqlite3.connect('job.db')
cursor = conn.execute("SELECT * FROM JOB")
for i in cursor:
    print(i)
conn.close()

(100, 'PRESIDENT', 50000, 100000)
(101, 'VICE PRESIDENT', 50000, 100000)
(102, 'DIRECTOR', 50000, 100000)
(103, 'MANAGER', 50000, 100000)

### 5) Write a SQL lite3 statement to create a table names as job_history including columns employee_id, start_date, end_date, job_id and department_id and make sure that, the employee_id column does not contain any duplicate value at the time of insertion and the foreign key column job_id contain only those values which are exists in the jobs table:

In [2]:
import sqlite3
conn = sqlite3.connect('job.db')
print("Database created successfully")
conn.execute('''CREATE TABLE JOB_HISTORY1(EMP_ID INT PRIMARY KEY NOT NULL, START_DATE DATE , END_DATE DATE, JOB_ID INT, DEPT_ID INT)''')
print("Table created successfully")
conn.close()

Database created successfully
Table created successfully

In [3]:
import sqlite3
conn = sqlite3.connect('job.db')
conn.execute('''INSERT INTO JOB_HISTORY1 VALUES(100, '2017-04-05', '2022-04-18', 097, 70)''')
conn.execute('''INSERT INTO JOB_HISTORY1 VALUES(101, '2016-08-14', '2018-09-09', 098, 71)''')
conn.execute('''INSERT INTO JOB_HISTORY1 VALUES(102, '2019-07-23', '2021-12-17', 099, 72)''')
conn.commit()
conn.close()

In [4]:
import sqlite3
conn = sqlite3.connect('job.db')
cursor = conn.execute("SELECT * FROM JOB_HISTORY1")
for i in cursor:
    print(i)

(100, '2017-04-05', '2022-04-18', 97, 70)
(101, '2016-08-14', '2018-09-09', 98, 71)
(102, '2019-07-23', '2021-12-17', 99, 72)